vlsihieu/fresher-embedded/fresher/hello_clock/S32K166.h
/*
** ###################################################################
**     Processor:           S32K116_64
**     Reference manual:    S32K1XXRM Rev. 6, 12/2017
**     Version:             rev. 1.1, 2017-12-18
**     Build:               b171219
**
**     Abstract:
**         Peripheral Access Layer for S32K116
**
**     Copyright (c) 1997 - 2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2017 NXP
**     All rights reserved.
**
**     THIS SOFTWARE IS PROVIDED BY NXP "AS IS" AND ANY EXPRESSED OR
**     IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
**     OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
**     IN NO EVENT SHALL NXP OR ITS CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
**     INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
**     (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
**     SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
**     HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
**     STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING
**     IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF
**     THE POSSIBILITY OF SUCH DAMAGE.
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2017-09-13) - Mihai Volmer
**         Initial version based on S32K1XXRM Rev. 5 DraftB, 08/2017.
**     - rev. 1.1 (2017-12-18) - Mihai Volmer
**         Updated the header based on S32K1XXRM Rev. 6, 12/2017.
**         Added ARM Cortex peripherals to the header file: NVIC, SysTick, SCB
**
** ###################################################################
*/

/*!
 * @file S32K116.h
 * @version 1.1
 * @date 2017-12-18
 * @brief Peripheral Access Layer for S32K116
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* ----------------------------------------------------------------------------
   -- MCU activation
   ---------------------------------------------------------------------------- */

/* Prevention from multiple including the same memory map */
#if !defined(S32K116_H_)  /* Check if memory map has not been already included */
#define S32K116_H_
#define MCU_S32K116

/* Check if another memory map has not been also included */
#if (defined(MCU_ACTIVE))
  #error S32K116 memory map: There is already included another memory map. Only one memory map can be included.
#endif /* (defined(MCU_ACTIVE)) */
#define MCU_ACTIVE

#include <stdint.h>

/** Memory map major version (memory maps with equal major version number are
 * compatible) */
#define MCU_MEM_MAP_VERSION 0x0100u
/** Memory map minor version */
#define MCU_MEM_MAP_VERSION_MINOR 0x0001u

/* ----------------------------------------------------------------------------
   -- Generic macros
   ---------------------------------------------------------------------------- */

/* IO definitions (access restrictions to peripheral registers) */
/**
*   IO Type Qualifiers are used
*   \li to specify the access to peripheral variables.
*   \li for automatic generation of peripheral register debug information.
*/
#ifndef __IO
#ifdef __cplusplus
  #define   __I     volatile             /*!< Defines 'read only' permissions                 */
#else
  #define   __I     volatile const       /*!< Defines 'read only' permissions                 */
#endif
#define     __O     volatile             /*!< Defines 'write only' permissions                */
#define     __IO    volatile             /*!< Defines 'read / write' permissions              */
#endif


/**
* @brief 32 bits memory read macro.
*/
#if !defined(REG_READ32)
  #define REG_READ32(address)               (*(volatile uint32_t*)(address))
#endif

/**
* @brief 32 bits memory write macro.
*/
#if !defined(REG_WRITE32)
  #define REG_WRITE32(address, value)       ((*(volatile uint32_t*)(address))= (uint32_t)(value))
#endif

/**
* @brief 32 bits bits setting macro.
*/
#if !defined(REG_BIT_SET32)
  #define REG_BIT_SET32(address, mask)      ((*(volatile uint32_t*)(address))|= (uint32_t)(mask))
#endif

/**
* @brief 32 bits bits clearing macro.
*/
#if !defined(REG_BIT_CLEAR32)
  #define REG_BIT_CLEAR32(address, mask)    ((*(volatile uint32_t*)(address))&= ((uint32_t)~((uint32_t)(mask))))
#endif

/**
* @brief 32 bit clear bits and set with new value
* @note It is user's responsability to make sure that value has only "mask" bits set - (value&~mask)==0
*/
#if !defined(REG_RMW32)
  #define REG_RMW32(address, mask, value)   (REG_WRITE32((address), ((REG_READ32(address)& ((uint32_t)~((uint32_t)(mask))))| ((uint32_t)(value)))))
#endif


/* ----------------------------------------------------------------------------
   -- Interrupt vector numbers for S32K116
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Interrupt_vector_numbers_S32K116 Interrupt vector numbers for S32K116
 * @{
 */

/** Interrupt Number Definitions */
#define NUMBER_OF_INT_VECTORS 48u                /**< Number of interrupts in the Vector table */

/**
 * @brief Defines the Interrupt Numbers definitions
 *
 * This enumeration is used to configure the interrupts.
 *
 * Implements : IRQn_Type_Class
 */
typedef enum
{
  /* Auxiliary constants */
  NotAvail_IRQn                = -128,             /**< Not available device specific interrupt */

  /* Core interrupts */
  NonMaskableInt_IRQn          = -14,              /**< Non Maskable Interrupt */
  HardFault_IRQn               = -13,              /**< Cortex-M0 SV Hard Fault Interrupt */
  SVCall_IRQn                  = -5,               /**< Cortex-M0 SV Call Interrupt */
  PendSV_IRQn                  = -2,               /**< Cortex-M0 Pend SV Interrupt */
  SysTick_IRQn                 = -1,               /**< Cortex-M0 System Tick Interrupt */

  /* Device specific interrupts */
  DMA0_IRQn                    = 0u,               /**< DMA channel 0 transfer complete */
  DMA1_IRQn                    = 1u,               /**< DMA channel 1 transfer complete */
  DMA2_IRQn                    = 2u,               /**< DMA channel 2 transfer complete */
  DMA3_IRQn                    = 3u,               /**< DMA channel 3 transfer complete */
  DMA_Error_IRQn               = 4u,               /**< DMA error interrupt channels 0-3 */
  ERM_fault_IRQn               = 5u,               /**< ERM single and double bit error correction */
  RTC_IRQn                     = 6u,               /**< RTC alarm interrupt */
  RTC_Seconds_IRQn             = 7u,               /**< RTC seconds interrupt */
  LPTMR0_IRQn                  = 8u,               /**< LPTIMER interrupt request */
  PORT_IRQn                    = 9u,               /**< Port A, B, C, D and E pin detect interrupt */
  CAN0_ORed_Err_Wakeup_IRQn    = 10u,              /**< ORâ€™ed [Bus Off OR Bus Off Done OR Transmit Warning OR Receive Warning], Interrupt indicating that errors were detected on the CAN bus, Interrupt asserted when Pretended Networking operation is enabled, and a valid message matches the selected filter criteria during Low Power mode */
  CAN0_ORed_0_31_MB_IRQn       = 11u,              /**< OR'ed Message buffer (0-15, 16-31) */
  FTM0_Ch0_7_IRQn              = 12u,              /**< FTM0 Channel 0 to 7 interrupt */
  FTM0_Fault_IRQn              = 13u,              /**< FTM0 Fault interrupt */
  FTM0_Ovf_Reload_IRQn         = 14u,              /**< FTM0 Counter overflow and Reload interrupt */
  FTM1_Ch0_7_IRQn              = 15u,              /**< FTM1 Channel 0 to 7 interrupt */
  FTM1_Fault_IRQn              = 16u,              /**< FTM1 Fault interrupt */
  FTM1_Ovf_Reload_IRQn         = 17u,              /**< FTM1 Counter overflow and Reload interrupt */
  FTFC_IRQn                    = 18u,              /**< FTFC Command complete, Read collision and Double bit fault detect */
  PDB0_IRQn                    = 19u,              /**< PDB0 interrupt */
  LPIT0_IRQn                   = 20u,              /**< LPIT interrupt */
  SCG_CMU_LVD_LVWSCG_IRQn      = 21u,              /**< PMC Low voltage detect interrupt, SCG bus interrupt request and CMU loss of range interrupt */
  WDOG_IRQn                    = 22u,              /**< WDOG interrupt request out before wdg reset out */
  RCM_IRQn                     = 23u,              /**< RCM Asynchronous Interrupt */
  LPI2C0_Master_Slave_IRQn     = 24u,              /**< LPI2C0 Master Interrupt and Slave Interrupt */
  FLEXIO_IRQn                  = 25u,              /**< FlexIO Interrupt */
  LPSPI0_IRQn                  = 26u,              /**< LPSPI0 Interrupt */
  ADC0_IRQn                    = 28u,              /**< ADC0 interrupt request. */
  CMP0_IRQn                    = 29u,              /**< CMP0 interrupt request */
  LPUART1_RxTx_IRQn            = 30u,              /**< LPUART1 Transmit / Receive  Interrupt */
  LPUART0_RxTx_IRQn            = 31u               /**< LPUART0 Transmit / Receive Interrupt */
} IRQn_Type;

/*!
 * @}
 */ /* end of group Interrupt_vector_numbers_S32K116 */


/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer for S32K116
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer_S32K116 Device Peripheral Access Layer for S32K116
 * @{
 */

